Revit 2026 API

# RebarContainerAppendItemFromCurves(RebarStyle, RebarBarType, RebarHookType, RebarHookType, XYZ, IListCurve, RebarTerminationOrientation, RebarTerminationOrientation, Boolean, Boolean) Method

---
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public RebarContainerItem AppendItemFromCurves(
	RebarStyle style,
	RebarBarType barType,
	RebarHookType startHook,
	RebarHookType endHook,
	XYZ normal,
	IList<Curve> curves,
	RebarTerminationOrientation startHookOrient,
	RebarTerminationOrientation endHookOrient,
	bool useExistingShapeIfPossible,
	bool createNewShape
)
```
```vb
Public Function AppendItemFromCurves (
	style As RebarStyle,
	barType As RebarBarType,
	startHook As RebarHookType,
	endHook As RebarHookType,
	normal As XYZ,
	curves As IList(Of Curve),
	startHookOrient As RebarTerminationOrientation,
	endHookOrient As RebarTerminationOrientation,
	useExistingShapeIfPossible As Boolean,
	createNewShape As Boolean
) As RebarContainerItem
```
```cpp
public:
RebarContainerItem^ AppendItemFromCurves(
	RebarStyle style,
	RebarBarType^ barType,
	RebarHookType^ startHook,
	RebarHookType^ endHook,
	XYZ^ normal,
	IList<Curve^>^ curves,
	RebarTerminationOrientation startHookOrient,
	RebarTerminationOrientation endHookOrient,
	bool useExistingShapeIfPossible,
	bool createNewShape
)
```
```fsharp
member AppendItemFromCurves :
        style : RebarStyle *
        barType : RebarBarType *
        startHook : RebarHookType *
        endHook : RebarHookType *
        normal : XYZ *
        curves : IList<Curve> *
        startHookOrient : RebarTerminationOrientation *
        endHookOrient : RebarTerminationOrientation *
        useExistingShapeIfPossible : bool *
        createNewShape : bool -> RebarContainerItem
```

#### Parameters

style RebarStyle

barType RebarBarType

startHook RebarHookType

endHook RebarHookType

normal XYZ

curves IListCurve

startHookOrient RebarTerminationOrientation

endHookOrient RebarTerminationOrientation

useExistingShapeIfPossible Boolean

createNewShape Boolean

#### Return Value

RebarContainerItem

#### Reference

RebarContainer Class

AppendItemFromCurves Overload

Autodesk.Revit.DB.Structure Namespace